In [48]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math
import random
from random import randint 
import datetime
from datetime import datetime
# from env import host, user, password
# url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [ ]:
# Exercises I
# Run python -m pip install pymysql from your terminal to install pymysql.

# Create a notebook or python script named advanced_dataframes to do your work in for these exercises.

# Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)
# cd into your exercises folder for this module and run echo env.py >> .gitignore





# Once you have successfully run a query:

# a. Intentionally make a typo in the database url. What kind of error message do you see?

# b. Intentionally make an error in your SQL query. What does the error message look like?

# Read the employees and titles tables into two separate DataFrames.

# How many rows and columns do you have in each DataFrame? Is that what you expected?

# Display the summary statistics for each DataFrame.

# How many unique titles are in the titles DataFrame?

# What is the oldest date in the to_date column?

# What is the most recent date in the to_date column?

In [17]:
# 3. # Create a function named get_db_url. 
# It should accept a username, hostname, password, and database name and return a url connection string formatted 
# like in the example at the start of this lesson.

def get_db_url(str_mysql_db):
    from env import user, password, host
    return f'mysql+pymysql://{user}:{password}@{host}/{str_mysql_db}'

In [ ]:
# 4. Use your function to obtain a connection to the employees database.

get_db_url('employees')

In [ ]:
# 5. Once you have successfully run a query:

# 5a. Intentionally make a typo in the database url. What kind of error message do you see?

test_url = get_db_url('employee')
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', test_url)
# returns back the following error message
# OperationalError: (1044, "Access denied for user 'kalpana_1823'@'%' to database 'employee'")

In [ ]:
# 5b. Intentionally make an error in your SQL query. What does the error message look like?

url = get_db_url('employees')
pd.read_sql('SELECT * FROM employees LIMT 5 OFFSET 50', url) # "LIMT" instead of "LIMIT" typo

# sql query typo returns back the following error message:
# ProgrammingError: (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '5 OFFSET 50' at line 1")

In [23]:
# 6. Read the employees and titles tables into two separate DataFrames.

url = get_db_url('employees')

employees_table = pd.read_sql('SELECT * FROM employees', url)
employees_table.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [67]:
employees_db_tables = pd.read_sql('SHOW TABLES', url)
titles_table = pd.read_sql('SELECT * FROM titles', url)

titles_table.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [28]:
# 7. How many rows and columns do you have in each DataFrame? Is that what you expected?

employees_table.shape

# 300,024 rows/records
# 6 columns

(300024, 6)

In [29]:
# 7. continued

titles_table.shape

# 443,308 rows/records
# 4 columns

(443308, 4)

In [60]:
# 8. Display the summary statistics for each DataFrame

# notes:
# first, i want to check the 'type' of data that i am working with
# i've noticed that numerical values such as dates are 'object' data types in this table
# i may be able to run descriptive statistics on these dates, so i will take the following approach...
# from datetime import datetime
# create a copy of the employees table - 
# this is so that I dont hard code any changes to the original datafram and should i need to refer back to it
# i then want to change the column 'date' data type to datetime type
# i want to then return the orginal table and check to see if any discrepancies/error occur
# lastly, run another 'describe()' and check what is returned

employees_table.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [62]:
employees_table_copy = employees_table.copy()

In [37]:
employees_table_copy = employees_table.copy()
employees_table_copy

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [63]:
# 8. continued 

titles_table.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [65]:
titles_table.dtypes # samething with above 'employees' table and dates being read as 'object' types

emp_no        int64
title        object
from_date    object
to_date      object
dtype: object

In [77]:
# 9. How many unique titles are in the titles DataFrame?

titles_table.title.unique()

# there are 7 unique title positions

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

In [92]:
# 10. What is the oldest date in the to_date column?
# example: mpg[mpg['manufacturer'] == 'dodge'].sort_values(by=['average_mileage'], ascending=[False])

titles_table.sort_values(by=['to_date']).head()

# where 1985-03-01 is the oldest to_date

        emp_no            title   from_date     to_date
16064    20869         Engineer  1985-02-17  1985-03-01
406358  474918         Engineer  1985-02-10  1985-03-11
346216  434232            Staff  1985-02-26  1985-03-20
35527    34059  Senior Engineer  1985-02-10  1985-03-23
277603  287732            Staff  1985-04-14  1985-04-17

In [107]:
# 11. What is the most recent date in the to_date column?

# i want to not account for current roles; denoted as "9999-01-01"
# to_date column data type = 'object'
# will want to create a new boolean column to filter for roles that are current
# can then sort_values by not_current = 'true' and to_date = in descending ordder
# this should indicate roles that are not current, but that are 'most' current

titles_table['not_current'] = titles_table['to_date'] != '9999-01-01' #not working properly
titles_table

        emp_no            title   from_date     to_date  not_current
0        10001  Senior Engineer  1986-06-26  9999-01-01         True
1        10002            Staff  1996-08-03  9999-01-01         True
2        10003  Senior Engineer  1995-12-03  9999-01-01         True
3        10004         Engineer  1986-12-01  1995-12-01         True
4        10004  Senior Engineer  1995-12-01  9999-01-01         True
...        ...              ...         ...         ...          ...
443303  499997         Engineer  1987-08-30  1992-08-29         True
443304  499997  Senior Engineer  1992-08-29  9999-01-01         True
443305  499998     Senior Staff  1998-12-27  9999-01-01         True
443306  499998            Staff  1993-12-27  1998-12-27         True
443307  499999         Engineer  1997-11-30  9999-01-01         True

[443308 rows x 5 columns]

In [ ]:
titles_table[titles_table['not_current'] == True].
titles_table.sort_values(by=['to_date'], ascending=False).head()